## Aula 2: Introdução Pandas

## 1) Pandas

O **[Pandas](https://pandas.pydata.org/)** é uma das bibliotecas mais usadas em data science.

Esta biblioteca, construída a partir do Numpy, possibilita a estruturação e manipulação de dados de maneira simples e eficiente.

Comos os dados são a matéria prima de todo projeto de data science, manipulá-los é fundamental! Por isso, utilizaremos o Pandas em quase todas as aulas daqui pra frente!

### DataFrame

O objeto do Pandas que mais utilizaremos será o **DataFrame**

Como veremos a seguir, o DataFrame é uma estrutura que se assemalha a uma **tabela**.

### Lendo dados de um arquivo

A forma mais comum de se construir um dataframe é a partir da **leitura de um arquivo**

Em geral, queremos ler arquivos já estruturados como base de dados, em formatos como .csv, .txt, .xlsx, etc.

O pandas é capaz de ler todos esses formatos, com funções específicas!

### 1. Faça um programa que imprima as linhas do arquivo alunos.csv

In [5]:
import pandas as pd

In [8]:
df = pd.read_csv("./datasets/alunos.csv", sep=';')

In [9]:
df

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201   Antonio Carlos          20      6.5      8.5      7.0        6
1  110212      Ana Beatriz          20      7.0      7.0      7.0        8
2  110218    Carlos Vernes          17      7.0      7.0      7.0        7
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7
5  110281   Juliana Arruda          18      7.5      7.0      7.5        8
6  110301        Joao Galo          20      5.0      6.5      7.0        5
7  110263     José Valente          20     10.0     10.0     10.0       10
8  110271   Maria Ferreira          19      9.5      8.0      7.0       10
9  110236  Adriana Tavares          20      8.0      8.0      8.0        8

In [14]:
print(df)

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201   Antonio Carlos          20      6.5      8.5      7.0        6
1  110212      Ana Beatriz          20      7.0      7.0      7.0        8
2  110218    Carlos Vernes          17      7.0      7.0      7.0        7
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7
5  110281   Juliana Arruda          18      7.5      7.0      7.5        8
6  110301        Joao Galo          20      5.0      6.5      7.0        5
7  110263     José Valente          20     10.0     10.0     10.0       10
8  110271   Maria Ferreira          19      9.5      8.0      7.0       10
9  110236  Adriana Tavares          20      8.0      8.0      8.0        8

In [21]:

for col in df:
    print(col)

RA
Nome
Frequencia
Prova_1
Prova_2
Prova_3
Prova_4

In [22]:
cols = []
for col in df:
    print(col)
    cols.append(col)

RA
Nome
Frequencia
Prova_1
Prova_2
Prova_3
Prova_4

In [30]:
# Pegando as colunas do DataFrame
print(df.columns)
print(type(df.columns))
print('-'*32)
print(list(df.columns))
print('-'*32)
print((df.columns.tolist()))

Index(['RA', 'Nome', 'Frequencia', 'Prova_1', 'Prova_2', 'Prova_3', 'Prova_4'], dtype='object')
<class 'pandas.core.indexes.base.Index'>
--------------------------------
['RA', 'Nome', 'Frequencia', 'Prova_1', 'Prova_2', 'Prova_3', 'Prova_4']
--------------------------------
['RA', 'Nome', 'Frequencia', 'Prova_1', 'Prova_2', 'Prova_3', 'Prova_4']

In [31]:
df

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201   Antonio Carlos          20      6.5      8.5      7.0        6
1  110212      Ana Beatriz          20      7.0      7.0      7.0        8
2  110218    Carlos Vernes          17      7.0      7.0      7.0        7
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7
5  110281   Juliana Arruda          18      7.5      7.0      7.5        8
6  110301        Joao Galo          20      5.0      6.5      7.0        5
7  110263     José Valente          20     10.0     10.0     10.0       10
8  110271   Maria Ferreira          19      9.5      8.0      7.0       10
9  110236  Adriana Tavares          20      8.0      8.0      8.0        8

In [32]:
df.head(3)

       RA            Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201  Antonio Carlos          20      6.5      8.5      7.0        6
1  110212     Ana Beatriz          20      7.0      7.0      7.0        8
2  110218   Carlos Vernes          17      7.0      7.0      7.0        7

In [33]:
df.head(5)

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201   Antonio Carlos          20      6.5      8.5      7.0        6
1  110212      Ana Beatriz          20      7.0      7.0      7.0        8
2  110218    Carlos Vernes          17      7.0      7.0      7.0        7
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7

In [34]:
df.tail(3)

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
7  110263     José Valente          20     10.0     10.0     10.0       10
8  110271   Maria Ferreira          19      9.5      8.0      7.0       10
9  110236  Adriana Tavares          20      8.0      8.0      8.0        8

In [35]:
type(df)

pandas.core.frame.DataFrame

In [36]:
df

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201   Antonio Carlos          20      6.5      8.5      7.0        6
1  110212      Ana Beatriz          20      7.0      7.0      7.0        8
2  110218    Carlos Vernes          17      7.0      7.0      7.0        7
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7
5  110281   Juliana Arruda          18      7.5      7.0      7.5        8
6  110301        Joao Galo          20      5.0      6.5      7.0        5
7  110263     José Valente          20     10.0     10.0     10.0       10
8  110271   Maria Ferreira          19      9.5      8.0      7.0       10
9  110236  Adriana Tavares          20      8.0      8.0      8.0        8

In [37]:
df['Frequencia']

0    20
1    20
2    17
3    20
4    15
5    18
6    20
7    20
8    19
9    20
Name: Frequencia, dtype: int64

In [40]:
df['RA']

0    110201
1    110212
2    110218
3    110307
4    110275
5    110281
6    110301
7    110263
8    110271
9    110236
Name: RA, dtype: int64

In [45]:
df[['Frequencia', 'Prova_1', 'RA']]

   Frequencia  Prova_1      RA
0          20      6.5  110201
1          20      7.0  110212
2          17      7.0  110218
3          20      9.0  110307
4          15      6.5  110275
5          18      7.5  110281
6          20      5.0  110301
7          20     10.0  110263
8          19      9.5  110271
9          20      8.0  110236

In [46]:
df

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201   Antonio Carlos          20      6.5      8.5      7.0        6
1  110212      Ana Beatriz          20      7.0      7.0      7.0        8
2  110218    Carlos Vernes          17      7.0      7.0      7.0        7
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7
5  110281   Juliana Arruda          18      7.5      7.0      7.5        8
6  110301        Joao Galo          20      5.0      6.5      7.0        5
7  110263     José Valente          20     10.0     10.0     10.0       10
8  110271   Maria Ferreira          19      9.5      8.0      7.0       10
9  110236  Adriana Tavares          20      8.0      8.0      8.0        8

In [47]:
df.shape

(10, 7)

In [48]:
n_linhas, n_colunas = df.shape

In [50]:
print(f'''
O dataframe tem:
{n_linhas} linhas
{n_colunas} colunas''')

O dataframe tem:
10 linhas
7 colunas

In [51]:
df['RA']

0    110201
1    110212
2    110218
3    110307
4    110275
5    110281
6    110301
7    110263
8    110271
9    110236
Name: RA, dtype: int64

In [52]:
df['RA'].shape

(10,)

In [53]:
df.loc[0]

RA                    110201
Nome          Antonio Carlos
Frequencia                20
Prova_1                  6.5
Prova_2                  8.5
Prova_3                  7.0
Prova_4                    6
Name: 0, dtype: object

In [54]:
df.loc[0].shape

(7,)

In [56]:
df.loc[0].values

array([110201, 'Antonio Carlos', 20, 6.5, 8.5, 7.0, 6], dtype=object)

In [57]:
df.loc[0, 'Nome']

'Antonio Carlos'

## Faça um programa que imprima as linhas do arquivo alunos.csv como listas

In [64]:
for i in range(df.shape[0]):
    print(df.loc[i].values.tolist())

[110201, 'Antonio Carlos', 20, 6.5, 8.5, 7.0, 6]
[110212, 'Ana Beatriz', 20, 7.0, 7.0, 7.0, 8]
[110218, 'Carlos Vernes', 17, 7.0, 7.0, 7.0, 7]
[110307, 'Francisco Cunha', 20, 9.0, 8.5, 8.5, 10]
[110275, 'Sandra Rosa', 15, 6.5, 7.5, 7.0, 7]
[110281, 'Juliana Arruda', 18, 7.5, 7.0, 7.5, 8]
[110301, 'Joao Galo', 20, 5.0, 6.5, 7.0, 5]
[110263, 'José Valente', 20, 10.0, 10.0, 10.0, 10]
[110271, 'Maria Ferreira', 19, 9.5, 8.0, 7.0, 10]
[110236, 'Adriana Tavares', 20, 8.0, 8.0, 8.0, 8]

In [68]:
for i, linha in df.iterrows():
    print(i, linha.values.tolist())

0 [110201, 'Antonio Carlos', 20, 6.5, 8.5, 7.0, 6]
1 [110212, 'Ana Beatriz', 20, 7.0, 7.0, 7.0, 8]
2 [110218, 'Carlos Vernes', 17, 7.0, 7.0, 7.0, 7]
3 [110307, 'Francisco Cunha', 20, 9.0, 8.5, 8.5, 10]
4 [110275, 'Sandra Rosa', 15, 6.5, 7.5, 7.0, 7]
5 [110281, 'Juliana Arruda', 18, 7.5, 7.0, 7.5, 8]
6 [110301, 'Joao Galo', 20, 5.0, 6.5, 7.0, 5]
7 [110263, 'José Valente', 20, 10.0, 10.0, 10.0, 10]
8 [110271, 'Maria Ferreira', 19, 9.5, 8.0, 7.0, 10]
9 [110236, 'Adriana Tavares', 20, 8.0, 8.0, 8.0, 8]

In [75]:
for i, linha in df.iterrows():
    # Utilizando compreensão de lista para converter o valor da célula em string!
    lista_valores = [str(valor) for valor in linha.values.tolist()]
    
    # Utilizando a conversão de tipos do numpy
    lista_valores = linha.values.astype('str')
    print('\t'.join(lista_valores))

110201	Antonio Carlos	20	6.5	8.5	7.0	6
110212	Ana Beatriz	20	7.0	7.0	7.0	8
110218	Carlos Vernes	17	7.0	7.0	7.0	7
110307	Francisco Cunha	20	9.0	8.5	8.5	10
110275	Sandra Rosa	15	6.5	7.5	7.0	7
110281	Juliana Arruda	18	7.5	7.0	7.5	8
110301	Joao Galo	20	5.0	6.5	7.0	5
110263	José Valente	20	10.0	10.0	10.0	10
110271	Maria Ferreira	19	9.5	8.0	7.0	10
110236	Adriana Tavares	20	8.0	8.0	8.0	8

##  Faça um programa que imprima os elementos da coluna ‘Nome’ do arquivo alunos.csv.

In [78]:
df['Nome'][3:5]

3    Francisco Cunha
4        Sandra Rosa
Name: Nome, dtype: object

In [79]:
df[3:5]

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7

In [82]:
df.loc[3:4]

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7

In [83]:
df.loc[3:4, 'Nome']

3    Francisco Cunha
4        Sandra Rosa
Name: Nome, dtype: object

In [84]:
for nome in df['Nome'].values:
    print(nome)

Antonio Carlos
Ana Beatriz
Carlos Vernes
Francisco Cunha
Sandra Rosa
Juliana Arruda
Joao Galo
José Valente
Maria Ferreira
Adriana Tavares

## Faça um programa que copie os dados do arquivo alunos.csv para um arquivo chamado alunos2.csv

In [85]:
df.to_csv('./datasets/alunos2.csv')

In [86]:
df.to_csv('./datasets/alunos2.csv', sep=';', index=None)

In [87]:
df.to_excel('./datasets/alunos2.xlsx', index=None)

## 5. Faça um programa que imprima o nome e a média de cada um dos alunos do arquivo alunos.csv

In [93]:
df[['Prova_1']]

   Prova_1
0      6.5
1      7.0
2      7.0
3      9.0
4      6.5
5      7.5
6      5.0
7     10.0
8      9.5
9      8.0

In [94]:
df[['Prova_1', 'Prova_2', 'Prova_3', 'Prova_4']]

   Prova_1  Prova_2  Prova_3  Prova_4
0      6.5      8.5      7.0        6
1      7.0      7.0      7.0        8
2      7.0      7.0      7.0        7
3      9.0      8.5      8.5       10
4      6.5      7.5      7.0        7
5      7.5      7.0      7.5        8
6      5.0      6.5      7.0        5
7     10.0     10.0     10.0       10
8      9.5      8.0      7.0       10
9      8.0      8.0      8.0        8

In [99]:
df

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201   Antonio Carlos          20      6.5      8.5      7.0        6
1  110212      Ana Beatriz          20      7.0      7.0      7.0        8
2  110218    Carlos Vernes          17      7.0      7.0      7.0        7
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7
5  110281   Juliana Arruda          18      7.5      7.0      7.5        8
6  110301        Joao Galo          20      5.0      6.5      7.0        5
7  110263     José Valente          20     10.0     10.0     10.0       10
8  110271   Maria Ferreira          19      9.5      8.0      7.0       10
9  110236  Adriana Tavares          20      8.0      8.0      8.0        8

In [95]:
coluna_provas = [col for col in df.columns if 'Prova' in col]

In [98]:
coluna_provas

['Prova_1', 'Prova_2', 'Prova_3', 'Prova_4']

In [100]:
df[coluna_provas]

   Prova_1  Prova_2  Prova_3  Prova_4
0      6.5      8.5      7.0        6
1      7.0      7.0      7.0        8
2      7.0      7.0      7.0        7
3      9.0      8.5      8.5       10
4      6.5      7.5      7.0        7
5      7.5      7.0      7.5        8
6      5.0      6.5      7.0        5
7     10.0     10.0     10.0       10
8      9.5      8.0      7.0       10
9      8.0      8.0      8.0        8

In [106]:
df.iloc[:, 3:]

   Prova_1  Prova_2  Prova_3  Prova_4
0      6.5      8.5      7.0        6
1      7.0      7.0      7.0        8
2      7.0      7.0      7.0        7
3      9.0      8.5      8.5       10
4      6.5      7.5      7.0        7
5      7.5      7.0      7.5        8
6      5.0      6.5      7.0        5
7     10.0     10.0     10.0       10
8      9.5      8.0      7.0       10
9      8.0      8.0      8.0        8

In [108]:
df[coluna_provas].mean()

Prova_1    7.6
Prova_2    7.8
Prova_3    7.6
Prova_4    7.9
dtype: float64

In [111]:
df[coluna_provas].mean(axis=1)

0     7.000
1     7.250
2     7.000
3     9.000
4     7.000
5     7.500
6     5.875
7    10.000
8     8.625
9     8.000
dtype: float64

In [112]:
df

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201   Antonio Carlos          20      6.5      8.5      7.0        6
1  110212      Ana Beatriz          20      7.0      7.0      7.0        8
2  110218    Carlos Vernes          17      7.0      7.0      7.0        7
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7
5  110281   Juliana Arruda          18      7.5      7.0      7.5        8
6  110301        Joao Galo          20      5.0      6.5      7.0        5
7  110263     José Valente          20     10.0     10.0     10.0       10
8  110271   Maria Ferreira          19      9.5      8.0      7.0       10
9  110236  Adriana Tavares          20      8.0      8.0      8.0        8

In [124]:
df['Media'] = df[coluna_provas].mean(axis=1)

In [129]:
for i, linha in df[['Nome', 'Media']].iterrows():
    nome = linha.Nome
    media = linha.Media
    print('\t'.join([str(x) for x in [nome, media]]))

Antonio Carlos	7.0
Ana Beatriz	7.25
Carlos Vernes	7.0
Francisco Cunha	9.0
Sandra Rosa	7.0
Juliana Arruda	7.5
Joao Galo	5.875
José Valente	10.0
Maria Ferreira	8.625
Adriana Tavares	8.0

In [131]:
df.Nome == df['Nome']

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: Nome, dtype: bool

6. Faça um programa que crie um arquivo media.csv e guarde o RA
(registro do aluno) junto com a respectiva média de cada um dos
alunos no arquivo alunos.csv.

In [139]:
df2 = df[['Nome', 'Média']].sort_values(['Média', 'Nome'])

In [144]:
df2

              Nome   Média
6        Joao Galo   5.875
0   Antonio Carlos   7.000
2    Carlos Vernes   7.000
4      Sandra Rosa   7.000
1      Ana Beatriz   7.250
5   Juliana Arruda   7.500
9  Adriana Tavares   8.000
8   Maria Ferreira   8.625
3  Francisco Cunha   9.000
7     José Valente  10.000

In [141]:
df2.loc[0]

Nome     Antonio Carlos
Média               7.0
Name: 0, dtype: object

In [143]:
df2.iloc[0]

Nome     Joao Galo
Média        5.875
Name: 6, dtype: object

In [138]:
df[['Nome', 'Média']].sort_values(['Média'])

              Nome   Média
6        Joao Galo   5.875
0   Antonio Carlos   7.000
2    Carlos Vernes   7.000
4      Sandra Rosa   7.000
1      Ana Beatriz   7.250
5   Juliana Arruda   7.500
9  Adriana Tavares   8.000
8   Maria Ferreira   8.625
3  Francisco Cunha   9.000
7     José Valente  10.000

In [135]:
df[['RA', 'Média']].to_csv('./datasets/media.csv', index=None)